In [27]:
import pandas as pd
from datetime import datetime

In [3]:
df = pd.read_csv('Adops & Data Scientist Sample Data - Q1 Analytics.csv')

In [4]:
df.head()

              ts user_id country_id site_id
0  2019/2/1 0:01  LC36FC        TL6   N0OTG
1  2019/2/1 0:10  LC39B6        TL6   N0OTG
2  2019/2/1 0:21  LC3500        TL6   N0OTG
3  2019/2/1 0:22  LC374F        TL6   N0OTG
4  2019/2/1 0:23  LCC1C3        TL6   QGO3G

### Question 1:
##### Consider only the rows with country_id = "BDV" (there are 844 such rows). For each site_id, we can compute the number of unique user_id's found in these 844 rows. Which site_id has the largest number of unique users? And what's the number?

In [8]:
BDV = df[df['country_id'] == 'BDV']
BDV.shape

(844, 4)

In [17]:
#Overview
# find number of unique elements in each user_id group
overview = BDV.groupby('site_id')['user_id'].nunique()
overview

site_id
3POLC      2
5NPAU    544
N0OTG     90
Name: user_id, dtype: int64

In [26]:
# ANS
#Get the detailed answer
print('number of unique users:',max(overview))
print('site_id:',[x for x in overview.index if overview[x] == max(overview) ])

number of unique users: 544
site_id: ['5NPAU']

### Question 2
#### Between 2019-02-03 00:00:00 and 2019-02-04 23:59:59, there are four users who visited a certain site more than 10 times. Find these four users & which sites they (each) visited more than 10 times. (Simply provides four triples in the form (user_id, site_id, number of visits) in the box below.)

In [102]:
# Preprocessing
# select data which within the time constraints
overview2 = df[(df['ts'] >= '2019/2/3 00:00:00' ) & (df['ts'] <= '2019/2/4 23:59:59')]
overview2.head()

                 ts user_id country_id site_id
1049  2019/2/3 0:02  LC3C7E        TL6   3POLC
1050  2019/2/3 0:03  LC3C7E        TL6   3POLC
1051  2019/2/3 0:03  LC3C7E        TL6   3POLC
1052  2019/2/3 0:04  LC3C7E        TL6   3POLC
1053  2019/2/3 0:04  LC3C7E        TL6   3POLC

In [103]:
# ans
# Get the counts
ans = overview2.groupby(['site_id','user_id']).count() 
ans = df2[df2['ts']>10]
ans

                 ts  country_id
site_id user_id
3POLC   LC3C7E   15          15
N0OTG   LC06C3   24          24
        LC3A59   26          26
        LC3C9D   11          11

### Question 3
#### For each site, compute the unique number of users whose last visit (found in the original data set) was to that site. For instance, user "LC3561"'s last visit is to "N0OTG" based on timestamp data. Based on this measure, what are top three sites? (hint: site "3POLC" is ranked at 5th with 28 users whose last visit in the data set was to 3POLC; simply provide three pairs in the form (site_id, number of users).)

In [151]:
# Preprocessing
# The following code firstly find the detail of last visit for distinct users then group by site_id to see  
#the unique number of users whose last visit (found in the original data set) was to that site
df.groupby('user_id',group_keys = False).apply(lambda x: x.sort_values('ts')).groupby('user_id').last().groupby('site_id').count().sort_values('ts',ascending = False)

          ts  country_id
site_id
5NPAU    987         987
N0OTG    567         567
QGO3G    288         288
GVOFK     42          42
3POLC     29          29
EUZ/Q      1           1
JSUUP      1           1
RT9Z6      1           1

### Question 4
#### For each user, determine the first site he/she visited and the last site he/she visited based on the timestamp data. Compute the number of users whose first/last visits are to the same website. What is the number?

In [158]:
# Detail of users's first visist
first_site_visited = df.groupby('user_id',group_keys = False).apply(lambda x: x.sort_values('ts')).groupby('user_id').first()
first_site_visited.head()

                     ts country_id site_id
user_id
LC00C3   2019/2/3 18:52        QLT   5NPAU
LC01C3   2019/2/4 11:35        QLT   5NPAU
LC05C3   2019/2/2 14:14        BDV   5NPAU
LC06C3   2019/2/1 22:49        TL6   N0OTG
LC07C3   2019/2/5 19:06        BDV   5NPAU

In [161]:
# Detail of users's last visit
last_site_visited = df.groupby('user_id',group_keys = False).apply(lambda x: x.sort_values('ts')).groupby('user_id').last()
last_site_visited.head()

                     ts country_id site_id
user_id
LC00C3   2019/2/3 18:52        QLT   5NPAU
LC01C3   2019/2/4 11:35        QLT   5NPAU
LC05C3   2019/2/2 14:14        BDV   5NPAU
LC06C3    2019/2/7 1:16        TL6   N0OTG
LC07C3   2019/2/5 19:06        BDV   5NPAU

In [162]:
# Merge by index which is user_id and save it for future use
overview4 = first_site_visited.merge(last_site_visited, left_index = True, right_index = True)

In [165]:
overview4.head()

,ts_x,country_id_x,site_id_x,ts_y,country_id_y,site_id_y
user_id,,,,,,
LC00C3,2019/2/3 18:52,QLT,5NPAU,2019/2/3 18:52,QLT,5NPAU
LC01C3,2019/2/4 11:35,QLT,5NPAU,2019/2/4 11:35,QLT,5NPAU
LC05C3,2019/2/2 14:14,BDV,5NPAU,2019/2/2 14:14,BDV,5NPAU
LC06C3,2019/2/1 22:49,TL6,N0OTG,2019/2/7 1:16,TL6,N0OTG
LC07C3,2019/2/5 19:06,BDV,5NPAU,2019/2/5 19:06,BDV,5NPAU

In [168]:
# Those user whose first/last visits are to the same website.
count_table = overview4[overview4['site_id_x'] == overview4['site_id_y']]
count_table.head()

,ts_x,country_id_x,site_id_x,ts_y,country_id_y,site_id_y
user_id,,,,,,
LC00C3,2019/2/3 18:52,QLT,5NPAU,2019/2/3 18:52,QLT,5NPAU
LC01C3,2019/2/4 11:35,QLT,5NPAU,2019/2/4 11:35,QLT,5NPAU
LC05C3,2019/2/2 14:14,BDV,5NPAU,2019/2/2 14:14,BDV,5NPAU
LC06C3,2019/2/1 22:49,TL6,N0OTG,2019/2/7 1:16,TL6,N0OTG
LC07C3,2019/2/5 19:06,BDV,5NPAU,2019/2/5 19:06,BDV,5NPAU

In [170]:
# Get the count
ans = count_table.shape[0]
ans

1676